app/Controllers/Alternatif.php

    public function index()
    {
        $alternatifModel = new AlternatifModel();
        $data = [
            'title' => "FAHP - Alternatif",
            'head' => "Data Alternatif",
            'alternatif' => $alternatifModel->get()->getResultArray()
---
SELECT *
FROM `alternatif`