app/Controllers/Dashboard.php

    public function index()
    {
        $kriteria = $this->kriteria->get()->getResultArray();
        $subKriteria = $this->subKriteria->get()->getResultArray();
        $alternatif = $this->alternatif->get()->getResultArray();
---
SELECT *
FROM `kriteria`
SELECT *
FROM `subkriteria`
SELECT *
FROM `alternatif`