app/Controllers/Kriteria.php

SELECT *
FROM `kriteria`
---
    public function index()
    {
        $kriteriaModel = new KriteriaModel();
        $data = [
            'title' => "FAHP - Kriteria",
            'head' => "Data Kriteria",
            'kriteria' => $kriteriaModel->get()->getResultArray()