app/Controllers/Subkriteria.php

SELECT *
FROM `kriteria`
---
    public function index()
    {
        $subkriteriaModel = new SubkriteriaModel();
        $kriteriaModel = new KriteriaModel();
        $data = [
            'title' => "FAHP - Subkriteria",
            'head' => "Data Subkriteria",
            'subkriteria' => $subkriteriaModel->get_subkriteria()->getResultArray(),
            'kriteria' => $kriteriaModel->get()->getResultArray()