app/Models/SubkriteriaModel.php

SELECT *, `subkriteria`.`id` as `id`
FROM `subkriteria`
JOIN `kriteria` ON `subkriteria`.`id_kriteria` = `kriteria`.`id`
ORDER BY `kode_subkriteria` ASC
---
    public function get_subkriteria(){
        $query = $this->db->table('subkriteria')->select("*, subkriteria.id as id")
        ->join('kriteria', 'subkriteria.id_kriteria = kriteria.id')
        ->orderBy('kode_subkriteria', 'ASC')->get();